[{"title": "Strawberry Rhubarb Margaritas", "summary": "Need a gluten free, fodmap friendly, and vegan beverage? Strawberry Rhubarb Margaritas could be a spectacular recipe to try. One serving contains 635 calories, 1g of protein, and 0g of fat. This recipe serves 4. For $6.39 per serving, this recipe covers 4% of your daily requirements of vitamins and minerals. 1 person has made this recipe and would make it again. It is perfect for Mother's Day. Head to the store and pick up triple sec, sugar, orange juice2 tablespoons ripped mint leaves, and a few other things to make it today. From preparation to the plate, this recipe takes around 2 hours and 30 minutes. All things considered, we decided this recipe deserves a spoonacular score of 11%. This score is rather bad. Try Rhubarb-Strawberry Margaritas, Strawberry Rhubarb Yogurt Cake with Strawberry Rhubarb Rum Sauce, and Rhubarb Margaritas {aka “The Farmgirl Margarita”} for similar recipes.", "steps": ["1. Watch how to make this recipe.", "2. Combine the Rhubarb Syrup, tequila, lime juice, triple sec, orange juice, mint leaves and some crushed ice in a shaker.", "3. Combine in batches, if necessary.", "4. Place the strawberries in the bottom of 4 margarita glasses. Strain the margaritas over the strawberries.", "5. Combine 1 1/2 cups water and the sugar in a medium saucepan over high heat. Cook until the sugar is dissolved.", "6. Add the rhubarb and cook until slightly softened, about 5 minutes.", "7. Remove the saucepan from the heat and steep for 1 hour.", "8. Drain the liquid into a small saucepan and cook over high heat until slightly reduced and thickened, about 5 minutes.", "9. Transfer the syrup to a bowl. Cover and chill in the refrigerator for about 1 hour."], "extendedIngredients": ["Crushed ice, for the shaker", "1/2 cup fresh lime juice", "1/4 cup freshly squeezed orange juice2 tablespoons fresh ripped mint leaves", "2 large stalks rhubarb, coarsely chopped", "8 fresh strawberries, hulled and finely diced", "1 1/2 cups sugar", "2 cups white tequila", "1/4 cup triple sec, such as Cointreau"], "pricePerServing": 624.29}, {"title": "No-Bake Lime Tarts (Gluten Free, Paleo + Vegan)", "summary": "Need a caveman, gluten free, primal, and vegan dessert? No-Bake Lime Tarts (Gluten Free, Paleo + Vegan) could be a spectacular recipe to try. This recipe serves 3 and costs $3.73 per serving. One serving contains 902 calories, 17g of protein, and 76g of fat. 1 person were impressed by this recipe. From preparation to the plate, this recipe takes roughly 30 minutes. A mixture of lime juice, coconut oil, sea salt, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe deserves a spoonacular score of 4%. This score is improvable. Try No-Bake Lemon Tarts (Gluten Free, Paleo + Vegan), Mini Berry Tarts (Paleo, Gluten Free + Vegan), and Chocolate Date Caramel Tarts (Gluten Free, Vegan, Paleo) for similar recipes.", "steps": ["1. Lightly grease three 4 tart pans or one 9 tart pan with coconut oil.For the crust, combine all of the ingredients for the crust and pulse to combine, breaking up the dates, until its fully moistened and sticks together.Press evenly along the bottom and up the sides of your prepared pan/s. Set aside.In the same food processor or blender (no need to wash between), combine all of the ingredients in the filling. Turn the food processor or blender on medium-high and blend for about 2 minutes, or until the mixture is silky smooth and creamy. Scrape down the sides as necessary. You may need to add a bit more coconut milk or lime juice to get it to blend smoothly if your blender isnt super high-powered. Once its smooth, taste and adjust the maple syrup or lime juice if desired, depending on your tastes.", "2. Pour the filling into the prepared crust and smooth the top.", "3. Place in the refrigerator for at least 1 hour to set before serving.", "4. Serve chilled, and keep any leftovers in the refrigerator for up to a week (or freezer for longer storage)."], "extendedIngredients": ["1 cup almond flour", "¼ cup canned coconut milk", "1 teaspoon cinnamon", "1/3 cup coconut oil", "2 tablespoons coconut oil", "4 pitted dates", "¼ teaspoon kosher salt", "½ cup lime juice", "2 tablespoons lime juice", "1 tablespoon lime zest", "1 teaspoon lime zest", "¼ cup maple syrup", "1 cup raw cashews (soaked in cold water for at least 4 hours or overnight)", "¼ teaspoon sea salt", "1 teaspoon vanilla extract"], "pricePerServing": 372.67}, {"title": "Falafels With Tahini Sauce", "summary": "Falafels With Tahini Sauce takes roughly roughly 45 minutes from beginning to end. One portion of this dish contains roughly 22g of protein, 19g of fat, and a total of 467 calories. This recipe serves 4. For $1.14 per serving, this recipe covers 23% of your daily requirements of vitamins and minerals. This recipe from Foodista requires tahini sauce, cumin, parsley, and jucie of lemons. It works well as a budget friendly main course. This recipe is liked by 2 foodies and cooks. It is a good option if you're following a dairy free, lacto ovo vegetarian, and vegan diet. Taking all factors into account, this recipe earns a spoonacular score of 86%, which is tremendous. Try Falafels And Tahini Sauce, Quinoa Falafels With Tahini Sauce, and Falafels with spicy tomato & cashew sauce & poached spring vegetables for similar recipes.", "steps": ["1. Soak the garbanzo beans overnight -drain.", "2. In a food processor add all the other ingredients except the flour and process until crumbly.", "3. Pour into a large bowl, add the flour a a tablespoon at the time and mix well.", "4. Keep adding flour until you can easily form the mixture into balls or patties without them falling apart.", "5. Place in the refridgerator and allow to chill while you make the Tahini Sauce.", "6. For the Tahini Sauce", "7. Place all the ingredients for the tahini sauce in the food processor and process until smooth, it should be a thin sauce.", "8. If it becomes too thick add more water or if you really like the tang add more lemon juice."], "extendedIngredients": ["1 cup garbazo beans (soaked overnight)", "1 medium onion chopped", "3 cloves garlic minced", "2 tablespoons cilantro chopped", "2 tablespoons parsley chopped", "1 teaspoon cumin", "1 teaspoon sea salt", "1 teaspoon dried red pepper flakes", "1 teaspoon baking powder", "5 tablespoons flour", "Tahini Sauce", "1/2 cup tahini paste", "1/2 cup water", "2 jucie of lemons", "3 cloves of garlic", "1/8 teaspoon of sea salt"], "pricePerServing": 114.42}]